n02b3rt/esp32s3-waveshare27690-bsp/examples/display_lvgl_demo/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM - OCTAL 80 MHz (R8 module)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# CPU 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS tick 1 kHz helps LVGL input timing
CONFIG_FREERTOS_HZ=1000

# USB CDC on boot (so serial works over native USB)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL: color depth 16 (byte-swap handled by esp_lvgl_port flags.swap_bytes)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_FONT_MONTSERRAT_24=y
